#+title: Ps 02
#+author: Erik An
#+email: obluda2173@gmail.com
#+date: <2026-01-26>
#+lastmod: <2026-04-13 17:28>
#+latex: \newpage
#+latex_header: \setlength{\parindent}{0pt}
#+latex_header: \setlength{\parskip}{1em}
#+latex_header: \usepackage{amsmath}
#+latex_header: \usepackage{amssymb}
#+latex_header: \usepackage{mathtools}
#+latex_header: \usepackage{amsthm}
#+latex_header: \usepackage[margin=1in]{geometry}
#+options: num:t tags:nil
#+property: header-args :eval never-export
#+startup: overview latexpreview inlineimages

** Solution
- Part (a)

  #+begin_quote
  *Note: While not explicitly required, I will first verify that the method is applicable.*
  #+end_quote

  To apply the /Bisection Method/ for finding a root, I must first prove that the function is continuous $\forall t \in \mathbb{R}$. If the function were discontinuous, the Bisection Method (and the Intermediate Value Theorem it relies on) might fail.

  Let's look at the given function:

  $$S(t)=\frac{3}{2}+\frac{1}{2}t+2(e^{\frac{2}{5}t}-1)$$

  Expanding the terms:

  \begin{align*}
        S(t) &= \frac{3}{2} + \frac{1}{2}t + 2e^{\frac{2}{5}t} - 2 \\
             &= 2e^{\frac{2}{5}t} + \frac{1}{2}t - \frac{1}{2} \\
  \end{align*}

  We can view $S(t)$ as the sum of two elementary functions, $r(t)$ and $h(t)$:

  \begin{align*}
        r(t) &= 2e^{\frac{2}{5}t} \quad \text{(Exponential)} \\
        h(t) &= \frac{1}{2}t - \frac{1}{2} \quad \text{(Linear Polynomial)} \\
  \end{align*}

  Both functions and polynomials are known to be continuous for all real numbers. Since the sum of continuous functions is also continuous, $S(t)$ is continuous $\forall t \in \mathbb{R}$.

  Therefore, the Intermediate Value Theorem (IVT) applies:

  /If $f$ is continuous on $\left[ a,b \right]$ and $f(a) < 0$ and $f(b) > 0$, then $\exists \xi \in \left( a,b \right) : f(\xi) = 0$./

  Since continuity is established, the Bisection Method is a valid choice.

  #+begin_src julia :results value :exports both :tangle julia/p_5.jl
  function bisection_method(f, a, b, tol=1e-6)
      m = 0.0
      while (abs(a-b) > tol)
          m = (a+b)/2
          (f(a) * f(m) < 0) ? b = m : a = m
      end
      return m
  end

  S(t) = 3/2 + t/2 + 2*(exp((2t)/(5))-1)

  bisection_method(S, -10, 10)
  #+end_src

  #+RESULTS:
  : -1.3401728868484497

- Part (b)

#+begin_src julia :results output :exports both :tangle julia/p_5.jl
function bisection_method(f, a, b, tol=1e-6)
    m = 0.0
    while (abs(a-b) > tol)
        m = (a+b)/2
        (f(a) * f(m) < 0) ? b = m : a = m
    end
    return m
end

S(t) = 3/2 + t/2 + 2*(exp((2t)/(5))-1)

root = bisection_method(t -> S(t) - 8, -10, 10)

println("Critical Temperature Anomaly: $root")
#+end_src

#+RESULTS:
: bisection_method (generic function with 2 methods)
: S (generic function with 1 method)
: 3.111853003501892
: Critical Temperature Anomaly: 3.111853003501892

